//Task1--------------------------------------------------------------------------------------
console.log("Task1--------------------------");
// - створити функцію яка виводить масив


let newArr = function (array){
    let arr = [123, "cat", false];
    console.log(arr);
}
newArr();


//Task2--------------------------------------------------------------------------------------
console.log("Task2--------------------------");
// - створити функцію яка заповнює масив рандомними числами та виводить його. Для виведення використати попвередню функцію.
let randomNum = function () {

}

// - створити функцію яка приймає три числа та виводить та повертає найменьше.
// - створити функцію яка приймає три числа та виводить та повертає найбільше.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
// - створити функцію яка виводить масив
// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел та складає значення елементів масиву та повертає його.
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - Створити функцію яка приймає масив будь яких объектів, та повертає значення кількості об'єктів в масиві
// - Створити функцію яка приймає масив будь яких объектів, та повертає загальн кількість полів в них
// - створити функцію  яка скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     Приклад
//     [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]
// - *** приймає масив та число "i", та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
// - *** створити функцію яка буде переносити елементи з значенням 0 у кінець маисву. Зберігаючи при цьому порядок не нульових значень.
// Двожина масиву від 2 до 100
// Приклад
// [1,0,6,0,3] => [1,6,3,0,0]
// [0,1,2,3,4] => [1,2,3,4,0]
// [0,0,1,0]   => [1,0,0,0]